{
  "name": "PJM MIDATL 5min DEEP Load Forecast 5mins",
  "TradingCalendar": "1",
  "TimeZone": "152",
  "ContinuousTraining": false,
  "company": "0",
  "OperationalMode": "Real Time",
  "OperationalSchedule": "Continuous",
  "use_levels": false,
  "market": "16",
  "description": "",
  "usePreTrain": false,
  "TrainingSchedule": "0",
  "ChangeProduct": 0,
  "TradeProduct": 0,
  "Output_API": "0",
  "IntervalStyle": "relative",
  "shouldTrain": true,
  "RelativeDateInterval": [
    {
      "CurveName": {
        "curveName": "MarketData:Node,7105642,Product,2,Type,2,SubType,3",
        "userReadable": "PJM-MIDATL-REGION  Energy  Volume  Actual "
      },
      "CurvePhase": "41",
      "CurveGrain": "13",
      "StartOffset": -30,
      "StartRegion": "4",
      "EndOffset": 0,
      "EndRegion": "13",
      "Action": "Training"
    },
    {
      "CurveName": {
        "curveName": "MarketData:Node,7105642,Product,2,Type,2,SubType,3",
        "userReadable": "PJM-MIDATL-REGION  Energy  Volume  Actual "
      },
      "CurvePhase": "45",
      "CurveGrain": "13",
      "StartOffset": 1,
      "StartRegion": "13",
      "EndOffset": 20,
      "EndRegion": "13",
      "Action": "Forecasting"
    }
  ],
  "AbsoluteDateInterval": [
    {
      "CurveName": "MarketData:Node,7105643,Product,2,Type,2,SubType,3",
      "CurvePhase": "37",
      "CurveGrain": "2",
      "StartDate": "2021-03-16T00:00:00.000Z",
      "EndDate": "2021-04-07T00:00:00.000Z",
      "Action": "Training"
    },
    {
      "CurveName": "MarketData:Node,7105643,Product,2,Type,2,SubType,3",
      "CurvePhase": "37",
      "CurveGrain": "2",
      "StartDate": "2021-04-08T00:00:00.000Z",
      "EndDate": "2021-04-09T00:00:00.000Z",
      "Action": "Forecasting"
    }
  ],
  "ForecastPredictors": [
    {
      "CurveName": {
        "curveName": "MarketData:Node,7105642,Product,2,Type,2,SubType,3",
        "userReadable": "PJM-MIDATL-REGION  Energy  Volume  Actual "
      },
      "CurveLabel": "Demand",
      "CurvePhase": "41",
      "ForecastPredictor": "7",
      "RearPoint": -1,
      "RearWindow": 0,
      "PercentChanges": false,
      "TargetType": "1",
      "ClassInteger": false,
      "ClassSubdivision": 0,
      "Normalize": false,
      "ForecastTarget": false
    },
    {
      "CurveName": {
        "curveName": "MarketData:Node,7105642,Product,2,Type,2,SubType,3",
        "userReadable": "PJM-MIDATL-REGION  Energy  Volume  Actual "
      },
      "CurveLabel": "Demand",
      "CurvePhase": "41",
      "ForecastPredictor": "7",
      "RearPoint": -288,
      "RearWindow": 0,
      "PercentChanges": false,
      "TargetType": "1",
      "ClassInteger": false,
      "ClassSubdivision": 0,
      "Normalize": false,
      "ForecastTarget": false
    },
    {
      "CurveName": {
        "curveName": "MarketData:Node,7105642,Product,2,Type,2,SubType,3",
        "userReadable": "PJM-MIDATL-REGION  Energy  Volume  Actual "
      },
      "CurveLabel": "Demand",
      "CurvePhase": "41",
      "ForecastPredictor": "7",
      "RearPoint": -2016,
      "RearWindow": 0,
      "PercentChanges": false,
      "TargetType": "1",
      "ClassInteger": false,
      "ClassSubdivision": 0,
      "Normalize": false,
      "ForecastTarget": false
    },
    {
      "CurveName": {
        "curveName": "MarketData:Node,7105642,Product,2,Type,2,SubType,6",
        "userReadable": "PJM-MIDATL-REGION  Energy  Volume  RTD "
      },
      "CurveLabel": "DAP",
      "CurvePhase": "23",
      "ForecastPredictor": "5",
      "RearPoint": 0,
      "RearWindow": 0,
      "PercentChanges": false,
      "TargetType": "1",
      "ClassInteger": false,
      "ClassSubdivision": 0,
      "Normalize": false,
      "ForecastTarget": false
    }
  ],
  "LatestPoint": null,
  "TechnicalIndicators": null,
  "BuiltinIndicators": [
    {
      "BuiltinIndicator": "1",
      "CosineConversion": true,
      "Normalize": false
    },
    {
      "BuiltinIndicator": "3",
      "CosineConversion": false,
      "Normalize": true
    },
    {
      "BuiltinIndicator": "2",
      "CosineConversion": true,
      "Normalize": false
    }
  ],
  "Classes": null,
  "GapMethod": "Linear Interpolation",
  "ExcludeBuiltin": false,
  "CosineConversion": false,
  "RecalculateClasses": false,
  "HitRatio": "0",
  "TrendRatio": "0",
  "UsePercentChanges": false,
  "NumPoints": 2,
  "HolidaySubstitute": 1,
  "HistoricHolidays": false,
  "normalization_method": "1",
  "ExcludeOutlierPoints": false,
  "ExcludeOutlierOnLap": false,
  "GroupByPeriod": false,
  "MeanCoefficient": 0.5,
  "OutlierDetection": 2,
  "MainJumpRemoval": 0,
  "PercentJumpRemoval": 0,
  "JumpCoeffMain": 0,
  "JumpCoeffPercent": 0,
  "MinValue": 0,
  "fill_strategy": "enhanced",
  "ai": {
    "model_structure": {
      "class_name": "Model",
      "config": {
        "name": "A name for the model",
        "layers": [
          {
            "name": "Input1",
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [],
              "dtype": "float32",
              "sparse": false,
              "name": "Input1"
            },
            "inbound_nodes": [
              []
            ]
          },
          {
            "name": "Dense1",
            "class_name": "Dense",
            "config": {
              "name": "Dense1",
              "units": 1,
              "activation": "relu",
              "kernel_initializer": {
                "class_name": "RandomNormal",
                "config": {
                  "mean": 0,
                  "stddev": 0.05,
                  "seed": null
                }
              },
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": {
                  "l1": 0,
                  "l2": 0
                }
              }
            },
            "inbound_nodes": [
              [
                [
                  "Input1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "Dense2",
            "class_name": "Dense",
            "config": {
              "name": "Dense2",
              "units": 1,
              "activation": "linear",
              "kernel_initializer": {
                "class_name": "RandomNormal",
                "config": {
                  "mean": 0,
                  "stddev": 0.05,
                  "seed": null
                }
              },
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": {
                  "l1": 0,
                  "l2": 0
                }
              }
            },
            "inbound_nodes": [
              [
                [
                  "Dense1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          }
        ],
        "input_layers": [
          [
            "Input1",
            0,
            0
          ]
        ],
        "output_layers": [
          [
            "Dense2",
            0,
            0
          ]
        ]
      },
      "keras_version": "2.3.1",
      "backend": "tensorflow"
    },
    "model_config": {
        "name": "deepModelGeneral",
        "epoch": 3,
        "batch_size": 50,
        "training_function": "adam",
        "loss_function": "mse",
        "seed": 0,
        "window_size": 5,
        "shuffle": false,
        "validation_split": 0.1,
        "learning_rate": 0.001
    },
    "model_type": "Deep"
  },
  "search_space_size": "",
  "algorithm": "genetic-algorithm",
  "n_iteration": "",
  "selection_mode": "",
  "selection_fract": "",
  "n_crossover": "",
  "crossover_mode": "",
  "mutation_prob": "",
  "runDiagnostics": false,
  "independentRun": false,
  "jobId": 1223,
  "runId": 217906
}